inteligencia-artificial.org
#+TITLE: Inteligência aritifical 
#+LANGUAGE: pt-br
#+DESCRIPTION: Resumo dos conceitos de inteligência artificial
#+AUTHOR: Jackson de Jesus
#+EXPORT_FILE_NAME: ia.html
#+OPTIONS: num:nil html5-fancy:t
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

** Capítulo 1

| Conceito | Definição |
|---|---|
| Inteligência Artificial (IA) | Área da tecnologia que busca simular o pensamento ou a ação humana para facilitar operações complexas. |
|  | Ápice da história da tecnologia, desde ferramentas rudimentares até a simulação de processos inteligentes. |
|  | Não possui uma definição única, variando conforme a interpretação de como os processos da IA se correlacionam com o cérebro e a mente humana. |
| Definições de IA | Quatro categorias: sistemas que pensam como humanos, sistemas que pensam racionalmente, sistemas que agem como humanos e sistemas que agem racionalmente. |
| Linhas de Pesquisa em IA | Simbólica, conexionista e evolucionária. |
| Linha Simbólica | Busca simular processos inteligentes utilizando linguagens lógicas e redes semânticas. |
|  | Exemplos: linguagens LISP e PROLOG, sistemas especialistas e ontologias. |
| Linha Conexionista | Inspirada na estrutura e funcionamento do cérebro, busca criar sistemas que simulem o comportamento de neurônios. |
|  | Exemplos: Redes Neurais Artificiais (RNA) e Sistemas Imunológicos Artificiais. |
| Linha Evolucionária | Utiliza princípios da evolução biológica, como seleção natural e mutação, para desenvolver sistemas inteligentes. |
|  | Exemplos: Algoritmos Genéticos e Programação Genética. |
| História da IA | Dividida em eras clássica, romântica e moderna, cada uma com seus objetivos e desafios. |
|  | Marcada por avanços e desafios, com previsões otimistas e subestimação da complexidade da inteligência humana. |

*** Resumo das categorias
|               | **Humanos**                       | **Racionalidade**               |
|---------------|------------------------------------|-----------------------------------|
| **Pensar**    | Sistemas que pensam como seres humanos | Sistemas que pensam racionalmente |
| **Agir**      | Sistemas que agem como seres humanos | Sistemas que agem racionalmente | 

** Capítulo 2

| Conceito | Descrição |
|---|---|
| **Agente** | Um artefato com sensores para perceber o ambiente e atuadores para agir sobre ele. Análogo a um ser humano, com sensores como olhos e ouvidos, e atuadores como mãos e pernas. |
| **Sensores** | Permitem ao agente perceber o ambiente, capturando sinais como imagens, sons, temperatura, etc. |
| **Atuadores** | Permitem ao agente agir sobre o ambiente, executando ações como mover-se, emitir sons, etc. |
| **Percepções** | Sinais capturados pelos sensores do agente a partir do ambiente. São processadas para gerar ações. |
| **Ações** | Respostas do agente ao ambiente, executadas por meio de seus atuadores. |
| **Função do agente** | Mapeia as ações do agente com base em suas percepções. Define o comportamento do agente. Uma descrição matemática abstrata do comportamento. |
| **Programa do agente** | Implementação concreta da função do agente. Traduz o mapeamento abstrato em instruções executáveis. |
| **Agente racional** | Agente que seleciona ações para maximizar sua medida de desempenho. Considera o sucesso da tarefa em suas decisões. |
| **Medida de desempenho** | Critério objetivo para avaliar o sucesso do agente na execução da tarefa. Define o que significa um bom desempenho. |
| **Conhecimento prévio** | Informações sobre o ambiente que o agente possui antes de iniciar sua tarefa. Influencia as decisões do agente. |
| **Sequência de percepções** | Histórico de percepções do agente até o momento presente. As ações são escolhidas considerando todas as percepções anteriores. |
| **Ambiente de tarefa** | Descrição completa do ambiente onde o agente atua, incluindo medidas de desempenho, sensores, atuadores e características do ambiente. |
| **PEAS (Performance, Environment, Actuators, and Sensors)** | Abordagem para definir o ambiente de tarefa, especificando desempenho, ambiente, atuadores e sensores. |
| **Propriedades do ambiente** | Características que classificam o ambiente, como observabilidade, determinismo, episodicidade, dinamicidade, etc. |
| **Tipos de agentes (estruturas)** | Categorias que descrevem o funcionamento interno dos agentes: reativos simples, reativos baseados em modelo, baseados em objetivos e baseados em utilidade. |
| **Agente reativo simples** | Seleciona ações com base apenas na percepção atual, ignorando o histórico. |
| **Agente reativo baseado em modelo** | Mantém um modelo interno do mundo e o utiliza para tomar decisões. Considera como o mundo evolui. |
| **Agente baseado em objetivos** | Toma decisões considerando seus objetivos, buscando alcançar estados desejáveis. |
| **Agente baseado em utilidade** | Utiliza uma função de utilidade para quantificar a "felicidade" de um estado e tomar decisões que maximizem essa utilidade. |
| **Agente com aprendizagem** | Agente capaz de adquirir conhecimento a partir da experiência, melhorando seu desempenho ao longo do tempo. |

