ia.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2024-09-01 dom 08:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Inteligência artificial</title>
<meta name="author" content="Jackson de Jesus" />
<meta name="description" content="Resumo dos conceitos de inteligência artificial" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Inteligência artificial</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Capítulos</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge527ee1">Capítulo 1</a>
<ul>
<li><a href="#orgde9c874">Resumo das categorias</a></li>
</ul>
</li>
<li><a href="#org377b105">Capítulo 2</a></li>
<li><a href="#org225a7c6">Capítulo 3</a></li>
<li><a href="#org8b788d1">Capítulo 4</a></li>
<li><a href="#org1e9deba">Capítulo 5</a></li>
<li><a href="#orgce4cdb2">Capítulo 6</a></li>
<li><a href="#org6ba7504">Observações&#x2026;</a>
<ul>
<li><a href="#org5b68b3a">Como organizei o conteúdo desta página</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgae627e8">Voltar para o início&#x2026;</a></div>
</div>

<div id="outline-container-orge527ee1" class="outline-3">
<h3 id="orge527ee1">Capítulo 1</h3>
<div class="outline-text-3" id="text-orge527ee1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Definição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Inteligência Artificial (IA)</td>
<td class="org-left">Área da tecnologia que busca simular o pensamento ou a ação humana para facilitar operações complexas.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Ápice da história da tecnologia, desde ferramentas rudimentares até a simulação de processos inteligentes.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Não possui uma definição única, variando conforme a interpretação de como os processos da IA se correlacionam com o cérebro e a mente humana.</td>
</tr>

<tr>
<td class="org-left">Definições de IA</td>
<td class="org-left">Quatro categorias: sistemas que pensam como humanos, sistemas que pensam racionalmente, sistemas que agem como humanos e sistemas que agem racionalmente.</td>
</tr>

<tr>
<td class="org-left">Linhas de Pesquisa em IA</td>
<td class="org-left">Simbólica, conexionista e evolucionária.</td>
</tr>

<tr>
<td class="org-left">Linha Simbólica</td>
<td class="org-left">Busca simular processos inteligentes utilizando linguagens lógicas e redes semânticas.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Exemplos: linguagens LISP e PROLOG, sistemas especialistas e ontologias.</td>
</tr>

<tr>
<td class="org-left">Linha Conexionista</td>
<td class="org-left">Inspirada na estrutura e funcionamento do cérebro, busca criar sistemas que simulem o comportamento de neurônios.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Exemplos: Redes Neurais Artificiais (RNA) e Sistemas Imunológicos Artificiais.</td>
</tr>

<tr>
<td class="org-left">Linha Evolucionária</td>
<td class="org-left">Utiliza princípios da evolução biológica, como seleção natural e mutação, para desenvolver sistemas inteligentes.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Exemplos: Algoritmos Genéticos e Programação Genética.</td>
</tr>

<tr>
<td class="org-left">História da IA</td>
<td class="org-left">Dividida em eras clássica, romântica e moderna, cada uma com seus objetivos e desafios.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Marcada por avanços e desafios, com previsões otimistas e subestimação da complexidade da inteligência humana.</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgde9c874" class="outline-4">
<h4 id="orgde9c874">Resumo das categorias</h4>
<div class="outline-text-4" id="text-orgde9c874">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><b><b>Humanos</b></b></th>
<th scope="col" class="org-left"><b><b>Racionalidade</b></b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Pensar</b></b></td>
<td class="org-left">Sistemas que pensam como seres humanos</td>
<td class="org-left">Sistemas que pensam racionalmente</td>
</tr>

<tr>
<td class="org-left"><b><b>Agir</b></b></td>
<td class="org-left">Sistemas que agem como seres humanos</td>
<td class="org-left">Sistemas que agem racionalmente</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org377b105" class="outline-3">
<h3 id="org377b105">Capítulo 2</h3>
<div class="outline-text-3" id="text-org377b105">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Agente</b></b></td>
<td class="org-left">Um artefato com sensores para perceber o ambiente e atuadores para agir sobre ele. Análogo a um ser humano, com sensores como olhos e ouvidos, e atuadores como mãos e pernas.</td>
</tr>

<tr>
<td class="org-left"><b><b>Sensores</b></b></td>
<td class="org-left">Permitem ao agente perceber o ambiente, capturando sinais como imagens, sons, temperatura, etc.</td>
</tr>

<tr>
<td class="org-left"><b><b>Atuadores</b></b></td>
<td class="org-left">Permitem ao agente agir sobre o ambiente, executando ações como mover-se, emitir sons, etc.</td>
</tr>

<tr>
<td class="org-left"><b><b>Percepções</b></b></td>
<td class="org-left">Sinais capturados pelos sensores do agente a partir do ambiente. São processadas para gerar ações.</td>
</tr>

<tr>
<td class="org-left"><b><b>Ações</b></b></td>
<td class="org-left">Respostas do agente ao ambiente, executadas por meio de seus atuadores.</td>
</tr>

<tr>
<td class="org-left"><b><b>Função do agente</b></b></td>
<td class="org-left">Mapeia as ações do agente com base em suas percepções. Define o comportamento do agente. Uma descrição matemática abstrata do comportamento.</td>
</tr>

<tr>
<td class="org-left"><b><b>Programa do agente</b></b></td>
<td class="org-left">Implementação concreta da função do agente. Traduz o mapeamento abstrato em instruções executáveis.</td>
</tr>

<tr>
<td class="org-left"><b><b>Agente racional</b></b></td>
<td class="org-left">Agente que seleciona ações para maximizar sua medida de desempenho. Considera o sucesso da tarefa em suas decisões.</td>
</tr>

<tr>
<td class="org-left"><b><b>Medida de desempenho</b></b></td>
<td class="org-left">Critério objetivo para avaliar o sucesso do agente na execução da tarefa. Define o que significa um bom desempenho.</td>
</tr>

<tr>
<td class="org-left"><b><b>Conhecimento prévio</b></b></td>
<td class="org-left">Informações sobre o ambiente que o agente possui antes de iniciar sua tarefa. Influencia as decisões do agente.</td>
</tr>

<tr>
<td class="org-left"><b><b>Sequência de percepções</b></b></td>
<td class="org-left">Histórico de percepções do agente até o momento presente. As ações são escolhidas considerando todas as percepções anteriores.</td>
</tr>

<tr>
<td class="org-left"><b><b>Ambiente de tarefa</b></b></td>
<td class="org-left">Descrição completa do ambiente onde o agente atua, incluindo medidas de desempenho, sensores, atuadores e características do ambiente.</td>
</tr>

<tr>
<td class="org-left"><b><b>PEAS (Performance, Environment, Actuators, and Sensors)</b></b></td>
<td class="org-left">Abordagem para definir o ambiente de tarefa, especificando desempenho, ambiente, atuadores e sensores.</td>
</tr>

<tr>
<td class="org-left"><b><b>Propriedades do ambiente</b></b></td>
<td class="org-left">Características que classificam o ambiente, como observabilidade, determinismo, episodicidade, dinamicidade, etc.</td>
</tr>

<tr>
<td class="org-left"><b><b>Tipos de agentes (estruturas)</b></b></td>
<td class="org-left">Categorias que descrevem o funcionamento interno dos agentes: reativos simples, reativos baseados em modelo, baseados em objetivos e baseados em utilidade.</td>
</tr>

<tr>
<td class="org-left"><b><b>Agente reativo simples</b></b></td>
<td class="org-left">Seleciona ações com base apenas na percepção atual, ignorando o histórico.</td>
</tr>

<tr>
<td class="org-left"><b><b>Agente reativo baseado em modelo</b></b></td>
<td class="org-left">Mantém um modelo interno do mundo e o utiliza para tomar decisões. Considera como o mundo evolui.</td>
</tr>

<tr>
<td class="org-left"><b><b>Agente baseado em objetivos</b></b></td>
<td class="org-left">Toma decisões considerando seus objetivos, buscando alcançar estados desejáveis.</td>
</tr>

<tr>
<td class="org-left"><b><b>Agente baseado em utilidade</b></b></td>
<td class="org-left">Utiliza uma função de utilidade para quantificar a "felicidade" de um estado e tomar decisões que maximizem essa utilidade.</td>
</tr>

<tr>
<td class="org-left"><b><b>Agente com aprendizagem</b></b></td>
<td class="org-left">Agente capaz de adquirir conhecimento a partir da experiência, melhorando seu desempenho ao longo do tempo.</td>
</tr>
</tbody>
</table>
</div>
</div>
