ia.html

<div id="outline-container-org225a7c6" class="outline-3">
<h3 id="org225a7c6">Capítulo 3</h3>
<div class="outline-text-3" id="text-org225a7c6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Agente de resolução de problemas</b></b></td>
<td class="org-left">Um tipo de agente inteligente que se concentra em encontrar sequências de ações para atingir um estado desejável. Difere dos agentes reativos, que apenas mapeiam estados para ações.</td>
</tr>

<tr>
<td class="org-left"><b><b>Formulação de problemas</b></b></td>
<td class="org-left">Processo crucial em IA que define quais estados e ações são relevantes para o problema, dado um objetivo específico. Envolve a escolha de representações adequadas para o problema.</td>
</tr>

<tr>
<td class="org-left"><b><b>Espaço de estados</b></b></td>
<td class="org-left">Conjunto de todos os estados possíveis que podem ser alcançados a partir do estado inicial, considerando as ações disponíveis. Visualizado como um grafo onde os nós são estados e os arcos são ações.</td>
</tr>

<tr>
<td class="org-left"><b><b>Componentes de um problema</b></b></td>
<td class="org-left">Quatro elementos formais: 1) Estado inicial, 2) Função sucessor, 3) Teste de objetivo e 4) Função de custo.</td>
</tr>

<tr>
<td class="org-left"><b><b>Estado inicial</b></b></td>
<td class="org-left">O estado em que o agente inicia a resolução do problema.</td>
</tr>

<tr>
<td class="org-left"><b><b>Função sucessor</b></b></td>
<td class="org-left">Define os estados alcançáveis a partir de um estado específico, considerando as ações possíveis. Retorna um conjunto de pares ordenados &lt;ação, sucessor&gt;.</td>
</tr>

<tr>
<td class="org-left"><b><b>Teste de objetivo</b></b></td>
<td class="org-left">Verifica se um estado alcançado corresponde ao estado desejado, determinando se o problema foi resolvido.</td>
</tr>

<tr>
<td class="org-left"><b><b>Função de custo (ou função de custo de caminho)</b></b></td>
<td class="org-left">Atribui um custo numérico a cada caminho (sequência de ações) no espaço de estados. Utilizada para avaliar a qualidade das soluções.</td>
</tr>

<tr>
<td class="org-left"><b><b>Solução ótima</b></b></td>
<td class="org-left">A solução com o menor custo entre todas as soluções possíveis para o problema. Encontrar a solução ótima é frequentemente o objetivo da resolução de problemas.</td>
</tr>

<tr>
<td class="org-left"><b><b>Tipos de problemas</b></b></td>
<td class="org-left">Classificados em miniproblemas (ilustrativos, com descrições concisas) e problemas do mundo real (complexos, geralmente subdivididos em problemas menores).</td>
</tr>

<tr>
<td class="org-left"><b><b>Exemplos de problemas</b></b></td>
<td class="org-left">Robô aspirador, puzzle de 8 peças, problema de roteirização, problema do caixeiro viajante.</td>
</tr>

<tr>
<td class="org-left"><b><b>Árvore de busca</b></b></td>
<td class="org-left">Estrutura utilizada por algumas técnicas de busca para representar o espaço de estados. A raiz é o estado inicial e os nós são expandidos usando a função sucessor.</td>
</tr>

<tr>
<td class="org-left"><b><b>Estratégias de busca</b></b></td>
<td class="org-left">Métodos para explorar o espaço de estados e encontrar soluções. Classificadas em busca sem informação (cega) e busca com informação (heurística).</td>
</tr>

<tr>
<td class="org-left"><b><b>Medidas de desempenho de busca</b></b></td>
<td class="org-left">Completeza, otimização, complexidade de tempo e complexidade de espaço.</td>
</tr>

<tr>
<td class="org-left"><b><b>Busca sem informação</b></b></td>
<td class="org-left">Explora o espaço de estados sem conhecimento específico do problema. Exemplos: busca em extensão, busca de custo uniforme, busca em profundidade.</td>
</tr>

<tr>
<td class="org-left"><b><b>Busca com informação</b></b></td>
<td class="org-left">Utiliza conhecimento adicional (heurísticas) para guiar a busca de forma mais eficiente. Exemplos: busca gulosa, algoritmo A*.</td>
</tr>

<tr>
<td class="org-left"><b><b>Função heurística (h(n))</b></b></td>
<td class="org-left">Função que estima o custo do caminho mais barato do nó atual até o nó objetivo. Utilizada em buscas com informação para melhorar a eficiência.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8b788d1" class="outline-3">
<h3 id="org8b788d1">Capítulo 4</h3>
<div class="outline-text-3" id="text-org8b788d1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b><b>Conceito</b></b></th>
<th scope="col" class="org-left"><b><b>Definição</b></b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Sistemas Especialistas (SE)</b></b></td>
<td class="org-left">Programas de computador que imitam o comportamento de especialistas humanos dentro de um domínio específico de conhecimento, sugerindo alternativas de ação.</td>
</tr>

<tr>
<td class="org-left"><b><b>Base de Conhecimento</b></b></td>
<td class="org-left">Parte de um sistema especialista onde fica armazenado o conhecimento obtido do domínio, traduzido em regras e memória de trabalho.</td>
</tr>

<tr>
<td class="org-left"><b><b>Quadro Negro</b></b></td>
<td class="org-left">Local onde as informações são alimentadas ao sistema, relacionadas às variáveis lidas do ambiente.</td>
</tr>

<tr>
<td class="org-left"><b><b>Mecanismo de Inferência</b></b></td>
<td class="org-left">Responsável pelo encadeamento e teste das regras, fornecendo resultados com base nos fatos alimentados ao sistema.</td>
</tr>

<tr>
<td class="org-left"><b><b>Aquisição de Conhecimento</b></b></td>
<td class="org-left">Processo de coleta e análise de informações de especialistas e outras fontes, essencial para o desenvolvimento de um sistema especialista.</td>
</tr>

<tr>
<td class="org-left"><b><b>Regras</b></b></td>
<td class="org-left">Sequências lógicas compostas por premissas (antecedentes) e conclusões (consequentes), usadas para representar o conhecimento em um sistema especialista.</td>
</tr>

<tr>
<td class="org-left"><b><b>Proposição</b></b></td>
<td class="org-left">Declaração que pode ser verdadeira ou falsa, usada para descrever relacionamentos em um sistema especialista.</td>
</tr>

<tr>
<td class="org-left"><b><b>Programação em Lógica (Prolog)</b></b></td>
<td class="org-left">Paradigma de programação baseado em lógica, especialmente útil para a criação de sistemas que raciocinam de acordo com a lógica de primeira ordem.</td>
</tr>

<tr>
<td class="org-left"><b><b>Coeficiente de Confiança</b></b></td>
<td class="org-left">Valor utilizado em regras probabilísticas para indicar a probabilidade ou confiança de que uma ação irá acontecer no sistema especialista.</td>
</tr>

<tr>
<td class="org-left"><b><b>Expert SINTA</b></b></td>
<td class="org-left">Shell utilizado para a implementação de sistemas especialistas, oferecendo funcionalidades como definição de variáveis e regras sem a necessidade de codificação complexa.</td>
</tr>
</tbody>
</table>
</div>
</div>
